{
	"systeminfo": "AVX = 1 | AVX2 = 1 | AVX512 = 0 | FMA = 1 | NEON = 0 | ARM_FMA = 0 | F16C = 1 | FP16_VA = 0 | WASM_SIMD = 0 | BLAS = 0 | SSE3 = 1 | VSX = 0 | ",
	"model": {
		"type": "base",
		"multilingual": false,
		"vocab": 51864,
		"audio": {
			"ctx": 1500,
			"state": 512,
			"head": 8,
			"layer": 6
		},
		"text": {
			"ctx": 448,
			"state": 512,
			"head": 8,
			"layer": 6
		},
		"mels": 80,
		"f16": 1
	},
	"params": {
		"model": "models/ggml-base.en.bin",
		"language": "en",
		"translate": false
	},
	"result": {
		"language": "en"
	},
	"transcription": [
		{
			"timestamps": {
				"from": "00:00:00,000",
				"to": "00:00:12,240"
			},
			"offsets": {
				"from": 0,
				"to": 12240
			},
			"text": " [Music]"
		},
		{
			"timestamps": {
				"from": "00:00:12,240",
				"to": "00:00:22,560"
			},
			"offsets": {
				"from": 12240,
				"to": 22560
			},
			"text": " Hi, my name is Peter, I work a time up more so and we met, we gave in approximately in February, I suppose."
		},
		{
			"timestamps": {
				"from": "00:00:22,560",
				"to": "00:00:33,360"
			},
			"offsets": {
				"from": 22560,
				"to": 33360
			},
			"text": " We had a short chat regarding our future collaboration and possibilities of us helping you with some parts of the Ethereum project."
		},
		{
			"timestamps": {
				"from": "00:00:33,360",
				"to": "00:00:47,160"
			},
			"offsets": {
				"from": 33360,
				"to": 47160
			},
			"text": " It happens that they work at the company that specializes in compilers, it's specialized right then, and it resulted in LVM implementation of EVM, that probably is going to describe."
		},
		{
			"timestamps": {
				"from": "00:00:47,160",
				"to": "00:01:05,160"
			},
			"offsets": {
				"from": 47160,
				"to": 65160
			},
			"text": " But at the same time we had a little misunderstanding among us and when Gavin described the Ethereum, our CEO remembered two phrases, during completeness and virtual machine."
		},
		{
			"timestamps": {
				"from": "00:01:05,160",
				"to": "00:01:17,160"
			},
			"offsets": {
				"from": 65160,
				"to": 77160
			},
			"text": " So after half an hour hit, we're great, that maybe it's per computer, that's something that can distribute computation and locally run it."
		},
		{
			"timestamps": {
				"from": "00:01:17,160",
				"to": "00:01:27,160"
			},
			"offsets": {
				"from": 77160,
				"to": 87160
			},
			"text": " So no, not exactly, it's more about the consensus and keeping a solid, compact state not about distributing computations."
		},
		{
			"timestamps": {
				"from": "00:01:27,160",
				"to": "00:01:45,160"
			},
			"offsets": {
				"from": 87160,
				"to": 105160
			},
			"text": " So what can we do? Maybe we can provide something like this. He called it Golan from Golan 14, it is a story written by a stainless-bob lamp."
		},
		{
			"timestamps": {
				"from": "00:01:45,160",
				"to": "00:01:56,160"
			},
			"offsets": {
				"from": 105160,
				"to": 116160
			},
			"text": " And we've got a machine that got some so large and complicated that it's gained awareness of itself."
		},
		{
			"timestamps": {
				"from": "00:01:56,160",
				"to": "00:02:03,160"
			},
			"offsets": {
				"from": 116160,
				"to": 123160
			},
			"text": " So nice, let's have a poor supercomputer, if we cannot do it, we can implement it ourselves."
		},
		{
			"timestamps": {
				"from": "00:02:03,160",
				"to": "00:02:17,160"
			},
			"offsets": {
				"from": 123160,
				"to": 137160
			},
			"text": " After another talk, we come to a conclusion that it doesn't really make sense because there are some attempts to implement something like this, and they do not work so far."
		},
		{
			"timestamps": {
				"from": "00:02:17,160",
				"to": "00:02:31,160"
			},
			"offsets": {
				"from": 137160,
				"to": 151160
			},
			"text": " Well, we have cloud computing, but this requires some structure over the machines and hardware, and we cannot build a supercomputer or provide computing power out of the box using just PCs."
		},
		{
			"timestamps": {
				"from": "00:02:31,160",
				"to": "00:02:40,160"
			},
			"offsets": {
				"from": 151160,
				"to": 160160
			},
			"text": " We stay at homes of any people who would like to provide computing power."
		},
		{
			"timestamps": {
				"from": "00:02:40,160",
				"to": "00:02:48,160"
			},
			"offsets": {
				"from": 160160,
				"to": 168160
			},
			"text": " So what to do? We should give some incentive to them, they should be able to make money and then maybe that would work."
		},
		{
			"timestamps": {
				"from": "00:02:48,160",
				"to": "00:02:59,160"
			},
			"offsets": {
				"from": 168160,
				"to": 179160
			},
			"text": " But still that's pretty hard because that would require registering into some services that would allow them to transfer value for the computing power that they would like to share."
		},
		{
			"timestamps": {
				"from": "00:02:59,160",
				"to": "00:03:12,160"
			},
			"offsets": {
				"from": 179160,
				"to": 192160
			},
			"text": " And obviously, the idea is that it should be backed up by it or Ethereum, and that's what we started to think about."
		},
		{
			"timestamps": {
				"from": "00:03:12,160",
				"to": "00:03:38,160"
			},
			"offsets": {
				"from": 192160,
				"to": 218160
			},
			"text": " The main idea is that we would like to provide users of regular PCs or web computers with possibilities of either distributing their computation across a peer-to-peer network or to make some value by providing their resources,"
		},
		{
			"timestamps": {
				"from": "00:03:38,160",
				"to": "00:03:50,160"
			},
			"offsets": {
				"from": 218160,
				"to": 230160
			},
			"text": " either computational storage or bandwidth for the matter, and it should allow them to do it pretty easily on both sides."
		},
		{
			"timestamps": {
				"from": "00:03:50,160",
				"to": "00:04:01,160"
			},
			"offsets": {
				"from": 230160,
				"to": 241160
			},
			"text": " Especially as the specifications tasks may not be so easy, but computations should be out of the box without any additional configuration."
		},
		{
			"timestamps": {
				"from": "00:04:01,160",
				"to": "00:04:08,160"
			},
			"offsets": {
				"from": 241160,
				"to": 248160
			},
			"text": " And they should get remuneration for computing something."
		},
		{
			"timestamps": {
				"from": "00:04:08,160",
				"to": "00:04:26,160"
			},
			"offsets": {
				"from": 248160,
				"to": 266160
			},
			"text": " And what's important is that we don't want them to get threatened by malicious nodes inside the network, so all computations have to be separated from their host machines."
		},
		{
			"timestamps": {
				"from": "00:04:26,160",
				"to": "00:04:45,160"
			},
			"offsets": {
				"from": 266160,
				"to": 285160
			},
			"text": " This is where virtual machines come into role, and in general, the task is some code, well, in fact, any code that can be written in one of support languages that we can distribute across the network and run inside the virtual machine with some constraints,"
		},
		{
			"timestamps": {
				"from": "00:04:45,160",
				"to": "00:05:05,160"
			},
			"offsets": {
				"from": 285160,
				"to": 305160
			},
			"text": " so first of all, we don't want to thread that computing node, and on the other hand, we wouldn't like to create an environment which would allow attackers, hackers, whatever malicious nodes they may be in the network to attack other computers,"
		},
		{
			"timestamps": {
				"from": "00:05:05,160",
				"to": "00:05:25,160"
			},
			"offsets": {
				"from": 305160,
				"to": 325160
			},
			"text": " but necessarily the host one, but some other. We can imagine a scenario when someone pre-press a DDoS attack distributed on a service just by sending a million tasks that would try to connect to some server, so this cannot happen."
		},
		{
			"timestamps": {
				"from": "00:05:25,160",
				"to": "00:05:47,160"
			},
			"offsets": {
				"from": 325160,
				"to": 347160
			},
			"text": " So we started our proof of concept, and right now we implemented, sorry for the naughty graphics, but that's how it looks like right now, whether we implemented a few renderers as a back-end, and right now we have both open source renderers and commercial production"
		},
		{
			"timestamps": {
				"from": "00:05:47,160",
				"to": "00:06:16,160"
			},
			"offsets": {
				"from": 347160,
				"to": 376160
			},
			"text": " renderers, added to the project, and you cannot see this here, but right here, there is a rendering of four images, the one shown here is the last one, the last one is mental array, I don't know if you know the renderer, it's a commercial renderer, and other three are two pigurities and one VRA, VRA is also a commercial renderer,"
		},
		{
			"timestamps": {
				"from": "00:06:16,160",
				"to": "00:06:29,160"
			},
			"offsets": {
				"from": 376160,
				"to": 389160
			},
			"text": " and the right panel we see, soft tasks, which means that small tasks that were distributed across the network and are being gathered into a final picture."
		},
		{
			"timestamps": {
				"from": "00:06:29,160",
				"to": "00:06:42,160"
			},
			"offsets": {
				"from": 389160,
				"to": 402160
			},
			"text": " So this is it. So we believe that such framework can be used for something more than just rendering, but in fact for any computation that can be distributed,"
		},
		{
			"timestamps": {
				"from": "00:06:42,160",
				"to": "00:07:04,160"
			},
			"offsets": {
				"from": 402160,
				"to": 424160
			},
			"text": " then in principle it should work as a MapReduce computation model, maybe bit more generic because we don't want just to distribute and gather results, but to prepare a graph, a cyclic graph of such tasks that can distribute their sub-tasks,"
		},
		{
			"timestamps": {
				"from": "00:07:04,160",
				"to": "00:07:18,160"
			},
			"offsets": {
				"from": 424160,
				"to": 438160
			},
			"text": " and then gather results, and based on that results, send another list of tasks to perform another computation. You can use it, we used it for rendering and for scientific calculations in chemistry."
		},
		{
			"timestamps": {
				"from": "00:07:18,160",
				"to": "00:07:25,160"
			},
			"offsets": {
				"from": 438160,
				"to": 445160
			},
			"text": " It can be used for multi-colon integration easily, even for Bitcoin mining if someone would like to do it."
		},
		{
			"timestamps": {
				"from": "00:07:25,160",
				"to": "00:07:42,160"
			},
			"offsets": {
				"from": 445160,
				"to": 462160
			},
			"text": " The main problem with this approach is that it requires means to validate and collect results because once it's set to a network, we have no idea who may be calculating and what value of those results may have."
		},
		{
			"timestamps": {
				"from": "00:07:42,160",
				"to": "00:07:58,160"
			},
			"offsets": {
				"from": 462160,
				"to": 478160
			},
			"text": " So if we can be completely invalid, then maybe partially invalid or simply valid. So we need some means of getting the right results and collecting them into the result that we need to use."
		},
		{
			"timestamps": {
				"from": "00:07:58,160",
				"to": "00:08:18,160"
			},
			"offsets": {
				"from": 478160,
				"to": 498160
			},
			"text": " So we hope that they have been common in Gollum and Ethereum because we can use Ethereum as a payment system, but on the other hand there are some modules and parts of the source code that seem pretty similar in both projects."
		},
		{
			"timestamps": {
				"from": "00:08:18,160",
				"to": "00:08:47,160"
			},
			"offsets": {
				"from": 498160,
				"to": 527160
			},
			"text": " So we have a very good peer-to-peer platform module and a transport layer along with no discovery and resource transfer, and very good resource sharing and management machinery, because when you write a program, you don't only try to access local files or web servers, but maybe other computers in the network and so on."
		},
		{
			"timestamps": {
				"from": "00:08:47,160",
				"to": "00:09:03,160"
			},
			"offsets": {
				"from": 527160,
				"to": 543160
			},
			"text": " So we can also use Ethereum to all be worked out, but that's the site of the Gollum, although I believe that some resource sharing would be also required in Ethereum if parts of code are going to be shared across the network."
		},
		{
			"timestamps": {
				"from": "00:09:03,160",
				"to": "00:09:14,160"
			},
			"offsets": {
				"from": 543160,
				"to": 554160
			},
			"text": " So the objective, the most important thing is to use Ethereum as a generic payment system, because the traditional approach looks like this."
		},
		{
			"timestamps": {
				"from": "00:09:14,160",
				"to": "00:09:32,160"
			},
			"offsets": {
				"from": 554160,
				"to": 572160
			},
			"text": " A user had to register to some service that allows him here to transfer value, and this is a centralized solution requires giving out some private data that would be stored somewhere."
		},
		{
			"timestamps": {
				"from": "00:09:32,160",
				"to": "00:09:35,160"
			},
			"offsets": {
				"from": 572160,
				"to": 575160
			},
			"text": " And some servers."
		},
		{
			"timestamps": {
				"from": "00:09:35,160",
				"to": "00:09:43,160"
			},
			"offsets": {
				"from": 575160,
				"to": 583160
			},
			"text": " And what I don't know should be a problem, maybe it's not a problem, we believe it is, that microtransactions are not supportive."
		},
		{
			"timestamps": {
				"from": "00:09:43,160",
				"to": "00:10:01,160"
			},
			"offsets": {
				"from": 583160,
				"to": 601160
			},
			"text": " When we distribute a large task into the network, it might be distributed across a broad subset of this network and many nodes, which is very difficult to handle when you use paper or small solutions."
		},
		{
			"timestamps": {
				"from": "00:10:01,160",
				"to": "00:10:11,160"
			},
			"offsets": {
				"from": 601160,
				"to": 611160
			},
			"text": " And should be relatively difficult to implement with Bitcoin, for example."
		},
		{
			"timestamps": {
				"from": "00:10:11,160",
				"to": "00:10:24,160"
			},
			"offsets": {
				"from": 611160,
				"to": 624160
			},
			"text": " I don't know what's the scale of supported granularity of microtransactions in Ethereum, what it's going to be, but I believe that it might be much better than the current solutions."
		},
		{
			"timestamps": {
				"from": "00:10:24,160",
				"to": "00:10:48,160"
			},
			"offsets": {
				"from": 624160,
				"to": 648160
			},
			"text": " We wouldn't like to fly to Ethereum with microtransactions, so that's some point we have to decide what's the level at which we can process transactions, because if it works out, then it might be thousands, hundreds of thousands a second, so that wouldn't be feasible."
		},
		{
			"timestamps": {
				"from": "00:10:48,160",
				"to": "00:11:00,160"
			},
			"offsets": {
				"from": 648160,
				"to": 660160
			},
			"text": " That's another, well, it's something groundbreaking, neither in terms of the idea, well, although putting it all together seem to be pretty difficult."
		},
		{
			"timestamps": {
				"from": "00:11:00,160",
				"to": "00:11:19,160"
			},
			"offsets": {
				"from": 660160,
				"to": 679160
			},
			"text": " And in terms of iterative contracts, just, I don't know, vanilla implementation of common contract that should take place in Ethereum, just used to transfer volume between participating nodes."
		},
		{
			"timestamps": {
				"from": "00:11:19,160",
				"to": "00:11:49,160"
			},
			"offsets": {
				"from": 679160,
				"to": 709160
			},
			"text": " And so, I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because I think that's a good question, because"
		},
		{
			"timestamps": {
				"from": "00:11:49,160",
				"to": "00:12:04,160"
			},
			"offsets": {
				"from": 709160,
				"to": 724160
			},
			"text": " So, for example, when you would like to host something for some time, and we have to pay in timely fashion or for hosting."
		},
		{
			"timestamps": {
				"from": "00:12:04,160",
				"to": "00:12:23,160"
			},
			"offsets": {
				"from": 724160,
				"to": 743160
			},
			"text": " From our perspective, this is how it looks, Golan money to be more independent solutions, but to make Golan really attractive, it has to be fully decentralized, and, well, more important, easy to use and easy to install."
		},
		{
			"timestamps": {
				"from": "00:12:23,160",
				"to": "00:12:35,160"
			},
			"offsets": {
				"from": 743160,
				"to": 755160
			},
			"text": " Forcing users to give out their data, credit card data, for example, doesn't seem to make any sense."
		},
		{
			"timestamps": {
				"from": "00:12:35,160",
				"to": "00:12:47,160"
			},
			"offsets": {
				"from": 755160,
				"to": 767160
			},
			"text": " Well, at least much as existing solutions requires a such registration, and they doesn't seem to make success with this approach."
		},
		{
			"timestamps": {
				"from": "00:12:47,160",
				"to": "00:13:00,160"
			},
			"offsets": {
				"from": 767160,
				"to": 780160
			},
			"text": " And as for Ethereum, I don't know, this is just a guess, but it's quite possible that software as a service approach may attract more programmers towards Ethereum."
		},
		{
			"timestamps": {
				"from": "00:13:00,160",
				"to": "00:13:03,160"
			},
			"offsets": {
				"from": 780160,
				"to": 783160
			},
			"text": " I cannot guarantee that, but it seems reasonable."
		},
		{
			"timestamps": {
				"from": "00:13:03,160",
				"to": "00:13:05,160"
			},
			"offsets": {
				"from": 783160,
				"to": 785160
			},
			"text": " And that's how it looks."
		},
		{
			"timestamps": {
				"from": "00:13:05,160",
				"to": "00:13:13,160"
			},
			"offsets": {
				"from": 785160,
				"to": 793160
			},
			"text": " If you're not bored with it, I can show you how the graphic outline of the system looks like."
		},
		{
			"timestamps": {
				"from": "00:13:13,160",
				"to": "00:13:22,160"
			},
			"offsets": {
				"from": 793160,
				"to": 802160
			},
			"text": " So, it's not that complicated, but it's not easy as well."
		},
		{
			"timestamps": {
				"from": "00:13:22,160",
				"to": "00:13:33,160"
			},
			"offsets": {
				"from": 802160,
				"to": 813160
			},
			"text": " I don't know if there is anything similar to Ethereum, but we need a solid, peer-to-peer layer built on top of some transfer player."
		},
		{
			"timestamps": {
				"from": "00:13:33,160",
				"to": "00:13:48,160"
			},
			"offsets": {
				"from": 813160,
				"to": 828160
			},
			"text": " We need network adapters to provide resource management and the global I/O, that would allow nodes to read and write data in a safe fashion."
		},
		{
			"timestamps": {
				"from": "00:13:48,160",
				"to": "00:13:53,160"
			},
			"offsets": {
				"from": 828160,
				"to": 833160
			},
			"text": " It has to be really well-documented."
		},
		{
			"timestamps": {
				"from": "00:13:53,160",
				"to": "00:14:04,160"
			},
			"offsets": {
				"from": 833160,
				"to": 844160
			},
			"text": " That protocol is protocol responsible for distributing across the network and gathering the results, as well as connecting it with the transaction system."
		},
		{
			"timestamps": {
				"from": "00:14:04,160",
				"to": "00:14:06,160"
			},
			"offsets": {
				"from": 844160,
				"to": 846160
			},
			"text": " That's the payment system."
		},
		{
			"timestamps": {
				"from": "00:14:06,160",
				"to": "00:14:12,160"
			},
			"offsets": {
				"from": 846160,
				"to": 852160
			},
			"text": " And this layer is all about the peer-to-peer network."
		},
		{
			"timestamps": {
				"from": "00:14:12,160",
				"to": "00:14:16,160"
			},
			"offsets": {
				"from": 852160,
				"to": 856160
			},
			"text": " Sorry."
		},
		{
			"timestamps": {
				"from": "00:14:16,160",
				"to": "00:14:26,160"
			},
			"offsets": {
				"from": 856160,
				"to": 866160
			},
			"text": " The upper layer is a client layer, and this center integration component was called the client before."
		},
		{
			"timestamps": {
				"from": "00:14:26,160",
				"to": "00:14:34,160"
			},
			"offsets": {
				"from": 866160,
				"to": 874160
			},
			"text": " And it's responsible for defining tasks and passing them to the layer that's responsible for computation."
		},
		{
			"timestamps": {
				"from": "00:14:34,160",
				"to": "00:14:44,160"
			},
			"offsets": {
				"from": 874160,
				"to": 884160
			},
			"text": " We can below this line, we can test it just on a single machine running the task on a few processes or even threads."
		},
		{
			"timestamps": {
				"from": "00:14:44,160",
				"to": "00:14:47,160"
			},
			"offsets": {
				"from": 884160,
				"to": 887160
			},
			"text": " So, that's good for testing purposes."
		},
		{
			"timestamps": {
				"from": "00:14:47,160",
				"to": "00:14:59,160"
			},
			"offsets": {
				"from": 887160,
				"to": 899160
			},
			"text": " As you can see, there's a virtual machine that is separated by another border because we don't want to give direct access from the virtual machine to external world."
		},
		{
			"timestamps": {
				"from": "00:14:59,160",
				"to": "00:15:10,160"
			},
			"offsets": {
				"from": 899160,
				"to": 910160
			},
			"text": " Especially, we wouldn't like to allow processes that might be written by someone to connect with any computer in the network."
		},
		{
			"timestamps": {
				"from": "00:15:10,160",
				"to": "00:15:17,160"
			},
			"offsets": {
				"from": 910160,
				"to": 917160
			},
			"text": " And above that, we have a task definition framework which describes in detail how tasks are specified."
		},
		{
			"timestamps": {
				"from": "00:15:17,160",
				"to": "00:15:25,160"
			},
			"offsets": {
				"from": 917160,
				"to": 925160
			},
			"text": " So, you say that the individual instance fields cannot connect to each other, so they're called shared resources."
		},
		{
			"timestamps": {
				"from": "00:15:25,160",
				"to": "00:15:31,160"
			},
			"offsets": {
				"from": 925160,
				"to": 931160
			},
			"text": " There are shared resources, but, well, I didn't tell that explicitly."
		},
		{
			"timestamps": {
				"from": "00:15:31,160",
				"to": "00:15:36,160"
			},
			"offsets": {
				"from": 931160,
				"to": 936160
			},
			"text": " The code that is run is just about any code you can write, but we can start."
		},
		{
			"timestamps": {
				"from": "00:15:36,160",
				"to": "00:15:48,160"
			},
			"offsets": {
				"from": 936160,
				"to": 948160
			},
			"text": " But we explicitly have to point which resources should be shared because we can, for example, try to download some data from a server."
		},
		{
			"timestamps": {
				"from": "00:15:48,160",
				"to": "00:15:52,160"
			},
			"offsets": {
				"from": 948160,
				"to": 952160
			},
			"text": " And that's not a problem if you do it with a node."
		},
		{
			"timestamps": {
				"from": "00:15:52,160",
				"to": "00:15:59,160"
			},
			"offsets": {
				"from": 952160,
				"to": 959160
			},
			"text": " When you distribute it over the network and every node downloads the same data, that may be a threat to that server."
		},
		{
			"timestamps": {
				"from": "00:15:59,160",
				"to": "00:16:12,160"
			},
			"offsets": {
				"from": 959160,
				"to": 972160
			},
			"text": " So, in this case, we can simply force the node that we distribute the task to download the data and then just distribute the downloaded data to computing nodes."
		},
		{
			"timestamps": {
				"from": "00:16:12,160",
				"to": "00:16:22,160"
			},
			"offsets": {
				"from": 972160,
				"to": 982160
			},
			"text": " What's starting, grouping task interfaces that interface responsible for creating a graph of the MapReduce task."
		},
		{
			"timestamps": {
				"from": "00:16:22,160",
				"to": "00:16:32,160"
			},
			"offsets": {
				"from": 982160,
				"to": 992160
			},
			"text": " And above that, we have either user interface, not similar to the one that they presented, but the one that should be easy to use and easy to specify tasks."
		},
		{
			"timestamps": {
				"from": "00:16:32,160",
				"to": "00:16:44,160"
			},
			"offsets": {
				"from": 992160,
				"to": 1004160
			},
			"text": " And multi-programming language support, which should, I hope, allow users to simply write code using some sort of standard library"
		},
		{
			"timestamps": {
				"from": "00:16:44,160",
				"to": "00:16:55,160"
			},
			"offsets": {
				"from": 1004160,
				"to": 1015160
			},
			"text": " and control structures that are similar to existing control structures in languages, for example, parallel for."
		},
		{
			"timestamps": {
				"from": "00:16:55,160",
				"to": "00:17:05,160"
			},
			"offsets": {
				"from": 1015160,
				"to": 1025160
			},
			"text": " That should be a distributed task and programmers shouldn't be really aware of what's going on down here."
		},
		{
			"timestamps": {
				"from": "00:17:05,160",
				"to": "00:17:20,160"
			},
			"offsets": {
				"from": 1025160,
				"to": 1040160
			},
			"text": " Okay. And we believe that there may be many, many, many virtual machine flavors, or maybe not technically but in terms of compute capabilities."
		},
		{
			"timestamps": {
				"from": "00:17:20,160",
				"to": "00:17:32,160"
			},
			"offsets": {
				"from": 1040160,
				"to": 1052160
			},
			"text": " And that virtual machines should be defined by users, which all this one probably that does not fit the whole picture as virtual machines."
		},
		{
			"timestamps": {
				"from": "00:17:32,160",
				"to": "00:17:41,160"
			},
			"offsets": {
				"from": 1052160,
				"to": 1061160
			},
			"text": " Or the configuration, in fact, would have to be distributed in a separate channel, not as a part of the application."
		},
		{
			"timestamps": {
				"from": "00:17:41,160",
				"to": "00:17:52,160"
			},
			"offsets": {
				"from": 1061160,
				"to": 1072160
			},
			"text": " But that may not be a problem at some point because we can allow users to distribute the data, the messages that they have such machines"
		},
		{
			"timestamps": {
				"from": "00:17:52,160",
				"to": "00:17:59,160"
			},
			"offsets": {
				"from": 1072160,
				"to": 1079160
			},
			"text": " and an interested party would be able to download and use it."
		},
		{
			"timestamps": {
				"from": "00:17:59,160",
				"to": "00:18:01,160"
			},
			"offsets": {
				"from": 1079160,
				"to": 1081160
			},
			"text": " Okay. I think that's it."
		},
		{
			"timestamps": {
				"from": "00:18:01,160",
				"to": "00:18:03,160"
			},
			"offsets": {
				"from": 1081160,
				"to": 1083160
			},
			"text": " Thanks for that."
		},
		{
			"timestamps": {
				"from": "00:18:03,160",
				"to": "00:18:08,160"
			},
			"offsets": {
				"from": 1083160,
				"to": 1088160
			},
			"text": " [Applause]"
		},
		{
			"timestamps": {
				"from": "00:18:08,160",
				"to": "00:18:28,160"
			},
			"offsets": {
				"from": 1088160,
				"to": 1108160
			},
			"text": " [Silence]"
		}
	]
}
